# Збільшити, зменшити ...
#
# Журі олімпіади пропонує вам розв'язати нескладну головоломку.
# Ми загадуємо два цілих числа, які тримаємо в таємниці, натомість повідомляємо вам два інших цілих числа A та B.
# Якщо перше наше невідоме число зменшити на A, а друге невідоме число збільшити на B, то невідомі числа стануть рівними.
# Якщо ж навпаки, перше невідоме число збільшити на A, а друге невідоме число зменшити на B, то перше невідоме число стане вдвічі більшим за друге.
# Напишіть програму, яка за числами A та B відгадає числа, які журі тримає в таємниці.
#
# Вхідні дані
# У першому рядку вхідних даних записано ціле число A, а у другому − ціле число B. Гарантується, що
# −10^9 ≤A≤ 10^9  та  −10^9 ≤B≤ 10^9
#
# Вихідні дані
# У перший рядок виведіть перше невідоме число, яке журі тримає в таємниці, а другий рядок − друге.
#
# Приклади
#
# Вхідні дані #1 - 1 1
# Відповідь #1 - 7 5
#
# Вхідні дані #2 - 1 2
# Відповідь #2 - 11 8

a = int(input())
b = int(input())

# Маємо систему рівнянь, яку треба привести до формули, а потім вже запрограмувати.
# x - a = y + b
# x + a = 2 * (y - b)

y = 2*a + 3*b
x = y + b + a

print(x, y)
