# Журі олімпіади з інформатики прийняло рішення, що всі учасники мають отримати сертифікат:- ті, хто набере не менш ніж 90% від максимальної кількості балів, отримають сертифікат OUTSTANDING − видатний результат;
# - ті, хто набере менше ніж 90%, але не менш ніж 74% від максимальної кількості балів, отримають сертифікат EXCELLENT − відмінний результат;- ті, хто набере менше ніж 74%, але не менш ніж 60% від максимальної кількості балів, отримають сертифікат VERY GOOD − дуже  добрий результат;
# - усі інші отримають сертифікат PARTICIPANT.Нам потрібна програма, для автоматизації вирішення, який сертифікат має отримати учасник олімпіади. Напишіть таку програму!
# Input
# У першому рядку вхідних даних записано натуральне число M − максимальний бал, який можна отримати на олімпіаді. У другому рядку записано дійсне число K − кількість балів учасника олімпіади. Гарантується, що 1≤M≤1000 та 0.0≤K≤M, число K подається не більш ніж з однією цифрою після крапки.
# OutputВиведіть назву сертифіката, який має отримати учасник олімпіади.

# Examples

# Input #1
# 100
# 100
# Answer #1
# OUTSTANDING

# Input #2
# 1000
# 850.5
# Answer #3
# EXCELLENT

# Input #4
# 1000
# 700.1
# Answer #4
# VERY GOOD

# Input #5
# 1000
# 599.9
# Answer #5
# PARTICIPANT


M = float(input())
K = float(input())

result = K / M

if result >= 0.9:
    print("OUTSTANDING")
elif result >= 0.74:
    print("EXCELLENT")
elif result >= 0.6:
    print("VERY GOOD")
else:
    print("PARTICIPANT")