# Магічна функція
#
# Нещодавно Козак Вус відвідав лекцію з математики. Після лекції він придумав наступну задачу.
# Нехай є 2 масиви a та b з n елементів. Тоді f(i,j)= a[i] * b[j] + b[i] * a[j], де 1≤i<j≤n.
# Козака Вуса дуже зацікавило максимальне значення функції f(i,j), де 1≤i<j≤n.
# Козак Вус вже стомився розв'язувати цю задачу, тому він просить Вас допомогти йому.
#
# Вхідні дані
# Перший рядок містить одне ціле число n (2≤n≤10^5) — довжина масивів a та b.
# Другий рядок містить n цілих чисел a[1], a[2], ... , a[n]  (1≤ a[i] ≤10^6) — масив a.
# Третій рядок містить n цілих чисел b[1], b[2], ... , b[n]  (0≤ b[i] ≤10^3) — масив b.
#
# Вихідні дані
# Виведіть єдине число — максимальне значення функції f(i,j), де 1≤i<j≤n.
#
# Приклади
# Вхідні дані #1
# 3
# 5 4 6
# 1 2 3
# Відповідь #1
# 24
#
# Вхідні дані #2
# 5
# 2 3 4 4 5
# 5 4 4 3 1
# Відповідь #2
# 28
#
# У першому прикладі можна вибрати i=2 та j=3, тоді f(2,3)= a[2] * b[3] + b[2] * a[3] = 4⋅3+2⋅6= =12+12=24
# У другому прикладі можна вибрати i=3 та j=4, тоді f(3,4)= a[3] * b[4] + b[3] * a[4] = 4⋅3+4⋅4= =12+16=28



n = int(input())

a = input().split()
for i in range(len(a)):
    a[i] = int(a[i])

b = input().split()
for i in range(len(b)):
    b[i] = int(b[i])

max = 0
for i in range(n):
    for j in range(i+1, n): # i+1 проставлено тому, що в умові задачі j завжди більший за i . Тому він починається не з 0, а з i+1
        res = a[i]*b[j] + a[j]*b[i]
        if res > max:
            max = res

print(max)