# Ігорчик та яблучка


# В Ігорчика є сад з трьома видами яблук: зелених, жовтих та червоних.
# Цього року він зібрав n зелених, m жовтих та k червоних яблук.
# Оскільки Ігорчик дружить з усіма сусідами, то він вирішив роздати яблука, які зібрав. Він знає, що кожен сусід буде задоволений,
# якщо Ігорчик подарує йому яблука принаймні двох різних видів.
# Допоможіть Ігорчику знайти максимальну кількість сусідів, які можуть бути задоволені.

# Input
# Перший рядок містить три цілі числа n, m та k (0≤n,m,k≤100) — кількість зелених, жовтих та червоних яблук відповідно.

# Output
# Виведіть одне ціле число — відповідь на задачу.

# Examples

# Input
# 6 3 4
# Answer
# 6

n = 6
m = 3
k = 4
neighbors = 0

while n > 0:  #поки зелених яблук більше0, пари робляться зелене-жовте, зелене-червоне
    if m > 0:
        n -= 1
        m -= 1
        neighbors += 1

    if n > 0 and k > 0:
        n -= 1
        k -= 1
        neighbors += 1

#тут зелені яблука закінчились. Можна подивитись, скільки пар можна зробити з жовтих і червоних

# while m>0  and  k>0 : # варіант кінцівки номер 1
#     m -= 1
#     k -= 1
#     neighbors += 1

neighbors += min(m, k) # варіант кінцівки номер 2

print(neighbors)
