//48.Фрукти       Рівень:Легкий

// В Анатолія є a яблук та b груш, а в Бориса c яблук та d груш.

// Вони хочуть роздати яблука та груші n дітям. Кожна дитина хоче x яблук та y груш.

// Визначте, чи зможе Анатолій та Борис роздати яблука та груші дітям так, щоб кожен отримав те, що він хоче.

// Input

// Перший рядок містить сім цілих чисел a, b, c, d, n, x, y (1≤a,b,c,d,n,x,y≤100).

// Output

// Виведіть «Yes», якщо хлопці зможуть це зробити, або «No» — інакше.

// Ви можете виводити букви у будь-якому регістрі.

// Examples

// Input                                           Answer 
// 3 4 5 4 3 1 2                                   Yes    


#include <bits/stdc++.h>
using namespace std;

int main(){
    int a, b, c, d, n, x, y;
    cin >> a >> b >> c >> d >> n >> x >> y;
    bool ans = false;
    ans = a+c>=n*x && b+d>=n*y;
    if (ans) {
        cout << "Yes" << endl;
    } else {
        cout << "No" << endl;
    }
}
