# https://uoi.eolymp.space/uk/problems/3

# Сьогодні Петрик нарешті написав екзамен з математичного аналізу. Всього на екзамені було a легких задач та b складних,
# при цьому кожна складна задача важила вдвічі більше балів ніж проста.
# Петрик пам'ятає, що не зміг розв'язати рівно x легких та рівно y складних задач, а всі інші задачі він точно розв'язав правильно.
# Тепер же Петрик цікавиться, чи радіти йому успішній здачі екзамену, якщо для складання екзамену треба набрати хоча б 51%
# від максимальної кількості балів.
# Зверніть увагу, що, якщо Петрик отримає 50.5% балів, то екзамен вважається не зданим.

# Вхідні дані
# Перший рядок містить чотири цілі числа a,b,x та y (1≤x≤a≤10^5, 1≤y≤b≤10^5).
#
# Вихідні дані
# У випадку якщо Петрик склав екзамен виведіть «YES», інакше «NO». Букви можна виводити у будь-якому регістрі.
#
# Приклади
#
# Вхідні дані #1
# 10 3 10 3
# Відповідь #1
# NO
#
# Вхідні дані #2
# 12 4 3 2
# Відповідь #2
# YES
#
# Вхідні дані #3
# 5 3 2 2
# Відповідь #3
# NO



a = 12
b = 4
x = 3
y = 2

points = (a-x) + 2*(b - y)
maxPoints = a+ 2*b
score = (points / maxPoints) * 100

if score >= 51:
    print("YES")
else:
    print("NO")