people= {
"Андрій Говорухін"      :        [6, 6, 1, 4, 9, 9, 10, 4, 8, 2, 3, 8],
"Василь Петров"         :        [2, 9, 4, 7, 6, 6, 3, 6, 5, 5, 2, 4],
"Гаврило Варфаломєєв"   :        [10, 10, 4, 10, 7, 9, 4, 6, 8, 1, 1, 1],
"Ілья Муромцев"         :        [1, 6, 4, 7, 10, 9, 5, 3, 7, 4, 7, 2],
"Кощій Невмерущий"      :        [3, 10, 1, 4, 1, 8, 10, 6, 2, 10, 7, 4],
"Максим Мухін"          :        [10, 8, 9, 9, 5, 8, 6, 5, 7, 2, 4, 10],
"Маргаріта Мартинова"   :        [9, 1, 5, 1, 10, 10, 2, 4, 4, 9, 8, 10],
"Петро Ніколаєв"        :        [2, 9, 5, 9, 1, 2, 8, 7, 8, 1, 9, 1],
"Поліна Гусєва"         :        [9, 2, 8, 7, 3, 9, 9, 5, 1, 9, 2, 6],
"Спиридон Шишкін"       :        [4, 7, 7, 3, 10, 9, 7, 2, 10, 9, 8, 1],
"Станіслав Твердолобов" :        [8, 1, 6, 1, 4, 1, 10, 8, 8, 1, 8, 8]
}

