# https://uoi.eolymp.space/uk/problems/42
# Козак Вус хоче дібратися з Києва у Кременчук. Відомо, що потяг з Києва у Кременчук коштує a гривень. Потяг з Києва у
# Харків коштує b гривень, а потяг з Харкова у Кременчук c гривень.
#
# Знайдіть мінімальну кількість гривень, які Козаку Вусу потрібно заплатити, щоб дібратися у Кременчук, можливо,
# через Харків.
#
# Вхідні дані
# Перший рядок містить три цілі числа a, b, c
#
# Вихідні дані
# Виведіть одне ціле число — мінімальну вартість.
#
# Приклади
#
# Вхідні дані #1
# 4 2 3
# Відповідь #1
# 4
#
# Вхідні дані #2
# 5 2 1
# Відповідь #2
# 3

a,b,c = map(int,input().split())
print(min(a,b+c))


#--------------------------------------------------

# https://uoi.eolymp.space/uk/problems/49
# Щасливі квитки
#
# Квиток, що складається з чотирьох цифр, вважається щасливим, якщо число, сформоване першими двома цифрами, ділиться на
# певне число k, а також число, сформоване останніми двома цифрами, ділиться на k.
# Наприклад, нехай k=3, тоді число 2199 вважається щасливим, бо 21 ділиться на 3, а також 99 ділиться на 3. А число 7565
# не є щасливим, бо число 65 на три не ділиться.
# Визначіть для трьох різних k (k=3, k=5, k=7), чи певне число n щасливе.
#
# Вхідні дані
# Перший рядок містить одне ціле число n Перший рядок містить одне ціле число n
#
# Вихідні дані
# У першому рядку виведіть «Yes», якщо n — щасливий квиток для k=3, або «No» — інакше.
# У другому рядку виведіть це саме, але для k=5.
# У третьому рядку виведіть це саме, але для k=7.
# Ви можете виводити букви у будь-якому регістрі.
#
# Приклади
#
# Вхідні дані #1
# 6075
# Відповідь #1
# Yes
# Yes
# No
#
# Вхідні дані #2
# 6342
# Відповідь #2
# Yes
# No
# Yes

n = input()
for k in [3,5,7]:
    print(int(n[:2]), int(n[2:]))
    if int(n[:2])%k==0 and int(n[2:])%k == 0:
        print("Yes")
    else:
        print("No")

#---------------------------------------------------------

# https://uoi.eolymp.space/uk/problems/50
# П'ятірка
#
# Знайдіть кількість чисел від l до r включно, які не містять 5 як цифру.
#
# Вхідні дані
# Перший рядок містить два цілі числа l та r
#
# Вихідні дані
# Виведіть одне ціле число.

# Вхідні дані #1
# 3 10
# Відповідь #1
# 7

# Вхідні дані #1
# 1 100
# Відповідь #1
# 81

n,m = map(int,input().split())
counter = 0
for i in range(n, m+1):
    if "5" not in str(i):
        counter+=1
print(counter)

#---------------------------------------

# https://uoi.eolymp.space/problems/55
# Міжнародна олімпіада
#
# Міжнародна олімпіада з інформатики проводиться кожного року, починаючи з 1989-го року.
# На першій олімпіаді 1989-го був лише один тур з однією задачею.
# Наступні три роки (1990-1992 роки) олімпіада уже проходила у два тури, на кожному з яких було по одній задачі.
# У 1993-му році було два тури. На першому було три задачі, а в другому лише одна.
# Починаючи з 1994-го року, на олімпіаді було по два тури, на кожному з яких було по три задачі. Єдиним виключенням є 2009 та 2010 роки, у яких на кожному турі було по чотири задачі.
#
# Вам дано рік проведення Міжнародної олімпіади з інформатики, визначте кількість задач, які були на цій олімпіаді.
#
# Вхідні дані
# Перший рядок містить одне ціле число n (1989 <= n <= 2021)
#
# Вихідні дані
# Виведіть одне ціле число — кількість задач.Виведіть одне ціле число — кількість задач.
#
# Приклади
#
# Приклад 1
# Вхідні дані
# 2021
# Вихідні дані
# 6
#
# Приклад 2
# Вхідні дані
# 2010
# Вихідні дані
# 8
#
# Приклад 3
# Вхідні дані
# 1991
# Вихідні дані
# 2

n = int(input())

if n == 1989:
    print(1)
elif 1990 <= n <= 1992:
    print(2)
elif n == 1993:
    print(4)
elif n == 2009 or n == 2010:
    print(8)
else:
    print(6)


# -----------------------------------------------------------
# https://uoi.eolymp.space/problems/61
# Тура
#
# Дано шахівниця розміром n×m. Тобто з n рядками та m стовпчиками.
# У цій шахівниці є лише одна фігура — тура. Вона знаходиться у нижньому лівому куті. Більше ніяких фігур немає.
# Нагадаємо, що тура за один хід може переміститися на будь-яку кількість клітин по горизонталі або вертикалі, але не по
# діагоналі.
# Знайдіть кількість клітин, на які тура може переміститися за один хід.
#
# На малюнку зображена традиційна шахівниця розміру 8×8. У ній тура може переміститися на всі клітини, які помічені
# зеленим. Таких всього 14, тому відповідь 14.
#
# Вхідні дані
# Перший рядок містить два цілі числа n та m (1≤n,m≤20) — розміри шахівниці.
#
# Вихідні дані
# Виведіть кількість клітин, на які тура може переміститися за один хід.Виведіть кількість клітин, на які тура може
# переміститися за один хід.
#
# Приклади
#
# Приклад 1
# Вхідні дані
# 8 8
# Вихідні дані
# 14
#
# Приклад 2
# Вхідні дані
# 3 2
# Вихідні дані
# 3
#
# Приклад 3
# Вхідні дані
# 14 31
# Вихідні дані
# 43

n, m = map(int, input().split())
c = n + m -2
print(c)

# -----------------------------------------------------------

# https://uoi.eolymp.space/problems/62
# Кава
#
# Андрій вирішив випити кави в одній Київській кав'ярні. Проте він згадав, що у Києві "червона зона".
# Нагадаємо, що у "червоній зоні" у Києві лише повністю вакциновані люди (тобто ті, які отримали два щеплення) можуть
# відвідувати кав'ярні. Якщо ж людина неповнолітня (строго менше ніж 18 років), то вона може відвідати кав'ярню лише з
# повністю вакцинованим дорослим, при цьому дитина не зобов'язана бути вакцинованою.
# Андрію n років та він отримав m щеплень. А його повнолітній батько, Борис, отримав уже k щеплень.
# Визначте, чи зможе Андрій потрапити у кав('ярню. Можливо, разом з батьком.
#
# Вхідні дані
# Перший рядок містить одне ціле числа n (12≤n≤30) — вік Андрія.
# Другий рядок містить два цілі числа m та k (0≤m,k≤2) — кількість щеплень, які отримали Андрій та Борис відповідно.
#
# Вихідні дані
# Виведіть «Yes», якщо Андрій зможе потрапити у кав'ярню, або «No» — інакше.
# Ви можете виводити букви у будь-якому регістрі.

# Приклад 1
# Вхідні дані
# 15
# 1 2
# Вихідні дані
# YES
#
# Приклад 2
# Вхідні дані
# 29
# 1 2
# Вихідні дані
# NO

n = int(input())
m, k = map(int, input().split())

if (n >= 18 and m == 2) or (n < 18 and k == 2):
    print("Yes")
else:
    print("No")


# -----------------------------------------------------------
# https://uoi.eolymp.space/problems/63
# Коробка
#
# У Козака Вуса є коробка, яка може вмістити до k кілограмів включно. Якщо у коробці будуть речі, вага яких перевищує k
# кілограмів, то вона порветься. У нього також є п'ять м'ячів вагою a1,a2,a3,a4,a5 кілограмів відповідно. Також відомо,
# що вага кожного наступного м'яча більша за попередню.
# Визначте максимальну кількість м'ячів, які можна положити у коробку так, що вона не порвалася.
#
# Вхідні дані
# Перший рядок містить одне ціле число k (1≤k≤100).
# Другий рядок містить п('ять цілих чисел a1,a2,a3,a4,a5 (1≤a≤25). Гарантується, що кожне наступне число більше за '
# попереднє.)
#
# Вихідні дані

# Приклад 1
# Вхідні дані
# 10
# 1 4 5 7 25
# Вихідні дані
# 3

# Приклад 2
# Вхідні дані
# 4
# 1 2 3 4 5
# Вихідні дані
# 2

# Приклад 3
# Вхідні дані
# 9
# 1 2 3 4 5
# Вихідні дані
# 3

k = int(input())
balls = list(map(int, input().split()))

count = 0
current_weight = 0

for weight in balls:
    if current_weight + weight <= k:
        current_weight += weight
        count += 1
    else:
        break

print(count)








