 # Наданий масив чисел, треба знайти значення, що є подавлячою більшістю.
 # Майоритарний елемент — це елемент, який з'являється більше ніж ⌊n / 2⌋ разів. Ви можете припустити, що майоритарний елемент завжди існує в масиві.

 # Example 1:
 # Input: nums = [3,2,3]
 # Output: 3
 #
 # Example 2:
 # Input: nums = [2,2,1,1,1,2,2]
 # Output: 2


#------------------------------------
#РІШЕННЯ ЗА ДОПОМОГОЮ СОРТУВАННЯ
#Можна відсортувати масив, і взяти число посередині. так як наше шукане має к-сть більше за половину масива, серединка в будь-якому випадку буде репрезентцвати шукане
#Сортування + взяти середину

#------------------------------------
#РІШЕННЯ ЗА ДОПОМОТОЮ ПЕРЕБОРУ

def finder(nums):
    dic = {} #словник для ключа (число), значення (к-сть входжень)
    max = 0 #максимальне входження
    majorityNumber = 0 #число, яке максимально входить

    print(f"Переберемо всі елементи масиву {nums}")
    for el in nums:
        print("-"*20)
        print(f"Беремо число {el}")
        if el not in dic:
            print("Такого числа ще немає в словнику, додаємо його туди як ключ і даємо йому значення 1 (к-сть входжень).")
            dic[el] = 1
            print(dic)
        else:
            print("Таке число вже є словнику, додаємо йому до ключа значення 1 (к-сть входжень +1).")
            dic[el] += 1
            print(dic)

        if dic[el] > max:
            print(f"Оу, кількість входжени числа {el} = {dic[el]} і воно перевищило попередній максимум ({max})! Тож тепер чило {el} з к-стью входжень {dic[el]} є новим максимумом")
            max = dic[el]
            majorityNumber = el


    print(f"Ми пройшли увесь масив, максимальне входження число {majorityNumber} ({dic[majorityNumber]} разів)")
    return majorityNumber

nums = [2,2,1,1,1,2,2]
result = finder(nums)
print(result)


# рішення номер 2
nums = [2,2,1,1,1,2,2]
for el in nums:
    if nums.count(el) > len(nums)/2:
        print(el)
        break







#------------------------------

#https://uoi.eolymp.space/uk/problems/21
# Сума тризначних паліндромів#
# Натуральне тризначне число називається паліндромом, якщо воно однаково читається зліва направо та справа наліво.
# Наприклад, тризначними паліндромами є числа: 202, 999, 727.
# Очевидно, що будь-яке натуральне тризначне число можна перетворити на тризначний паліндром, змінивши лише одну цифру,
# наприклад: 132→131 або 132→232.
# Розглянемо всі тризначні паліндроми, які можна отримати з заданого тризначного числа змінивши рівно одну цифру,
# тобто усі тризначні паліндроми, які відрізняються від заданого тризначного числа рівно в одному розряді.
# Напишіть програму, яка знайде суму усіх тризначних паліндромів, які можна отримати з заданого тризначного числа.

# Input
# Вашій програмі на вхід подається одне натуральне тризначне число.

# Output
# Виведіть одне число − суму всіх тризначних паліндромів, які відрізняються від заданого тризначного числа рівно в одному розряді.

# Examples

# Input #1
# 123
# Answer #1
# 444

# Input #2
# 120
# Answer #2
# 121

# Input #3
# 505
# Answer #3
# 4995

# --------------------------
# РІШЕННЯ ЗА ДОПОМОГОЮ МАСИВА З ЧИСЛАМИ

txt = input()
lst = []

for i in list(txt):
    lst.append(int(i)) #створюємо масив з числами

result = 0
if lst[0] == lst [2]: #варіант, якщо 1 і 3 числа однакові, наприклад 505, то результат буде 515+525+...+595
    for x in range(10):
        if lst[1] != x: #оригінальне число пропускаємо, не додаємо до суми, бо за умовою треба знайти суму паліндромів, без самого числа
            result = result + lst[0]*100 + x*10 + lst[2]
else:  # тепер міняємо місцями 1 і 3 , а потім 3 і 1 числа, щоб отримати поліндроми (123 -> 121, 323)
    result = result + lst[0]*100 + lst[1]*10 + lst[0] #підставляємо замість третього числа перше, наприклад 123 -> 121
    if lst[2] != 0: #якщо остання цифра числа 0, то паліндром з 0 не зробиш (120 не перетвориш на 020), тому числа з 0 в кінці пропускаємо
        result = result + lst[2] * 100 + lst[1] * 10 + lst[2]
print(result)

# --------------------------
# РІШЕННЯ ЗА ДОПОМОГОЮ ТЕКСТА

def change_char(txt, i, char): #функція міняє 1 індекс в тексті на заданний символ
    arr = list(txt)
    arr[i] = char
    new_string = ''.join(arr)
    return new_string

txt = input()

if txt[0] != txt[2]: #варіант, коли число не є саме поліндромом, тобто воно не є 505 або 434
    p1 = change_char(txt, 0, txt[2])  # робимо змінну з одним варіантом поліндрома
    p2 = change_char(txt, 2, txt[0])  # робимо змінну з іншим варіантом поліндрома

    if p1[0] == "0": # якшо перший символ 0 - то текстова строка міняється на 0
        p1 = "0"
    if p2[0] == "0": # якшо перший символ 0 - то текстова строка міняється на 0
        p2 = "0"

    sum = int(p1) + int(p2) #знаходимо суму

else: #варіант, коли число саме є поліндромом, тобто воно є 505 або 434
    sum = 0
    for i in range(10):
        if str(i) != txt[1]:
            p = change_char(txt, 1, str(i))
            sum += int(p)

print(sum)


# https://uoi.eolymp.space/uk/problems/5
# Скрутні часи
#
# У зв'язку зі страхом після останніх скорочень в IT секторі Петрик хоче оцінити свою продуктивність. Він як стабільний '
# працівник робить рівно одну робочу задачу за день, правда графік у нього специфічний: він працює a днів через b днів
# (тобто має a робочих днів поспіль та b вихідних після них).
# Петрик, бувши прихильником теорії хаотичного відпочинку, не працює кожен n-тий день, незалежно від того, чи є це
# робочим днем, чи вихідним. Проте, для компенсації, кожен m-тий день, якщо він для Петрика робочий, то він працює удвічі
# ефективніше, тобто робить дві задачі за день.
#
# Оцініть місячну продуктивність Петрика (скільки задач він зробить), якщо місяць має k днів та починається з першого
# робочого дня.
#
# Вхідні дані
# У першому рядку вказані п'ять цілих чисел a,b,n,m,k (1≤a,b,n,m,k≤10**5)
#
# Вихідні дані
# Виведіть єдине ціле число - продуктивність Петрика

a,b,n,m,k = map(int, input().split())
c = a + b
zadachi = 0

#Calendar work-weekend
for d in range(1,k+1):
    if (d - 1) % c < a: # (d - 1)%с через особливості рахуваннязалишку від ділення.
                        # Для a=3 та b=3 остача від ділення на 5 буде 0 і буде попадати в добірку
                        # d        d % 5
                        # 1          1   ← W
                        # 2          2   ← W
                        # 3          3   ← W
                        # 4          4   ← O
                        # 5          0   ← W
        first =True
    else:
        first = False
    #-------------------------

# Calendar po_liubomu_not_work
    if d%n==0:
        second = False
    else:
        second = True
    #----------------------------
# Calendar high productivity
    if d%m ==0:
        third = True
    else:
        third = False
    #----------------------------
    if first == True and second == False:
        if third ==True:
            zadachi += 2
        else:
            zadachi += 1

print(zadachi)

#-------------------------------------------

#Другий спосіб
a, b, n, m, k = map(int, input().split())

cycle = a + b
tasks = 0

for day in range(1, k + 1):

    # Робочі перші a днів кожного циклу
    is_working = (day - 1) % cycle < a

    # Кожен n-й день — вихідний незалежно від графіка
    if is_working and day % n != 0:

        # Кожен m-й робочий день — 2 задачі
        if day % m == 0:
            tasks += 2
        else:
            tasks += 1

print(tasks)


# -----------------------------------------------------------
# https://uoi.eolymp.space/problems/64
# Яблука
#
# У Козака Вуса є нескінченна кількість зелених, жовтих та червоних яблук.
# Він буде їх виставляти в один ряд за наступним алгоритмом:
# Спочатку g зелених яблук, потім y жовтих, потім r червоних, потім y жовтих, потім g зелених, а потім все знову
# нескінченну кількість разів. Наприклад, якщо g=1, y=3, r=4, то перші яблука виглядатимуть так:
# GYYYRRRRYYYGGYYYRRRRYYYGGYYYRRR...
# Тобто, всі яблука можна розбити на блоки. На цьому малюнку один блок це GYYYRRRRYYYG. Зверніть увагу, що блок
# починається і закінчується на один й той же символ. Саме тому на першому малюнку йдуть дві G підряд попри те, що g=1.
# Знайдіть колір яблука, що знаходиться на n-ій позиції.
#
# Вхідні дані
# Перший рядок містить чотири цілі числа n, g, y, r (1≤n,g,y,r≤10**12).
# Зверніть увагу, що числа не вміщаються у 32-бітні цілочисельні типи даних. Тому потрібно використовувати 64-бітні
# цілочисельні типи даних, такі як long long в C++, long в Java чи int64 в Pascal.
#
# Вихідні дані
# Якщо колір буде зелений, то виведіть «G».
# Якщо колір буде жовтий, то виведіть «Y».
# Якщо колір буде червоний, то виведіть «R».

# Приклад 1
# Вхідні дані
# 1 1 3 4
# Вихідні дані
# G

# Приклад 2
# Вхідні дані
# 12 1 3 4
# Вихідні дані
# G

# Приклад 3
# Вхідні дані
# 1000000000000 1 3 4
# Вихідні дані
# Y


n, g, y, r = map(int, input().split())

block_length = 2 * g + 2 * y + r #довжина блоку
pos = (n - 1) % block_length + 1 #номер позиції

if pos <= g:
    print("G")
elif pos <= g + y:
    print("Y")
elif pos <= g + y + r:
    print("R")
elif pos <= g + y + r + y:
    print("Y")
else:
    print("G")


#----------------------------------------------

#https://uoi.eolymp.space/problems/71
# Кінь
#
# Python
# Дано шахова дошка розміром 8×8. На цій дошці є лише одна фігура — кінь. Знайдіть кількість клітин, на яку кінь може
# переміститися за один хід.
# Нагадаємо, що кінь рухається буквою "Г". Формально, кінь може переміститися з клітини з координатами (x1,y1) у клітину
#  (x2,y2), якщо ∣x1−x2∣=1 та ∣y1−y2∣=2, або ж ∣x1−x2∣=2 та ∣y1−y2∣=1.
#
# Вхідні дані
# Перший рядок містить два символи. Перший символ — англійська буква від a до h у нижньому регістрі. Другий символ —
# цифра від 1 до 8.
#
# Вихідні дані
# Виведіть одне ціле число.
#
# Приклади
#
# Приклад 1
# Вхідні дані
# d4
# Вихідні дані
# 8
#
# Приклад 2
# Вхідні дані
# h1
# Вихідні дані
# 2

current_pos = input()
letters = {"a": 1,
        "b": 2,
        "c": 3,
        "d": 4,
        "e": 5,
        "f": 6,
        "g": 7,
        "h": 8}
current_x = letters[current_pos[0]]
current_y = int(current_pos[1])
counter = 0

moves = [[-2, -1], [-2, 1], [-1, -2], [-1, 2], [1, -2], [1, 2], [2, -1], [2, 1]]
for m in moves:
    dx = m[0]
    dy = m[1]
    new_x = current_x + dx
    new_y = current_y + dy
    if 1 <= new_x <= 8 and 1 <= new_y <= 8:
        counter += 1

print(counter)


#----------------------------------------------

# https://uoi.eolymp.space/problems/118
#
# Себек і сусіди
#
# Себека дуже не люблять сусіди. Тому вони вирішили зробити йому пастку.
# Сусіди намалювали на асфальті таблицю, що складається з n рядків і n стовпців. Рядки пронумеровані від 1 до n зверху
# вниз, а стовпці від 1 до n зліва направо. Таким чином таблиця складається з n рядків, у кожному з яких n клітинок.
# Вони пронумерували клітинки таблиці таким чином, що клітинки першого рядка мають номери від 1 до n зліва направо,
# другого рядка — номери від n+1 до 2n теж зліва направо і так далі. На малюнку знизу показано приклад таблиці для n=4.
#
# Приклад для n=4.
# Картинка - https://drive.google.com/file/d/1OnvSL7JUgHuSARN34ZMfuAt3R9fGoLbe/view?usp=sharing
#
# Злі сусіди пустили Себека бігати по таблиці та іноді його зупиняли. Коли він зупиняється, він повинен подивитися на
# число в тій клітинці таблиці, в якій він знаходиться, і відповісти на два питання:
# Чи він знаходиться на головній діагоналі таблиці?
# Чи він знаходиться на другорядній діагоналі?
# Нагадаємо, що головна діагональ — це діагональ, на якій знаходяться клітинки, що лежать між верхньою лівою і нижньою
# правою клітинками, вони позначені жовтим кольором на малюнку. Зауважте, що фігура — квадрат.
# А другорядна діагональ — це діагональ, на якій знаходяться клітинки, що лежать між верхньою правою і нижньою лівою
# клітинками, вони позначені блакитним кольором на малюнку.
#
# Уявіть, що ви Себек і вам треба відповідати на ці питання.
#
# Вхідні дані
# Перший рядок містить два цілих числа n та m (1≤n≤100,1≤m≤n⋅n) — розмір таблиці та номер клітинки, у якій знаходиться
# Себек під час чергової зупинки сусідами.
#
# Вихідні дані
# Виведіть два слова, розділених пробілом.
# Перше слово повинно бути «yes», якщо Себек знаходиться на головній діагоналі, і «no», якщо не знаходиться.
# Друге слово повинно бути «yes», якщо Себек знаходиться на другорядній діагоналі, і «no», якщо не знаходиться.
# Зауважте, що ви можете виводити літери у будь-якому регістрі. Тобто ви можете виводити як великі літери, так і маленькі.
#
# Приклади

# Приклад 1
# Вхідні дані
# 4 16
# Вихідні дані
# yes no
#
# Приклад 2
# Вхідні дані
# 4 2
# Вихідні дані
# no no
#
# Приклад 3
# Вхідні дані
# 4 10
# Вихідні дані
# no yes

size, pos = map(int, input().split())

diagonalies_1 = []
diagonalies_2 = []

for i in range(1, size+1):
    diagonalies_1.append( (i-1)*size + i )
    diagonalies_2.append( i*n-(i-1) )

print(pos in diagonalies_1, pos in diagonalies_2)


# --------------------------------------
# https://uoi.eolymp.space/problems/175
#
# Кімната
#
# Дана кімната розміром n×m. Знайдіть максимальну кількість цілих плиток розміром k×k, які можна помістити у кімнаті?
# https://drive.google.com/file/d/1lK_nM2C6JmhEgndt8S9ViJMakE9vATPD/view?usp=sharing
# На малюнку зображена одна з можливих максимальних відповідей для n=5, m=3, k=2.
#
# Вхідні дані
# Перший рядок містить ціле число n (1≤n≤1000).
# Другий рядок містить ціле число m (1≤m≤1000).
# Третій рядок містить ціле число k (1≤k≤1000).
#
# Вихідні дані
# Виведіть одне ціле число — відповідь на задачу.

# Приклад 1
# Вхідні дані
# 5
# 3
# 2
# Вихідні дані
# 2

n = int(input())
m = int(input())
k = int(input())

k_w = n // k #Скільки поміститься в довжину
k_h = m // k #Скільки поміститься в ширину
print(k_h*k_w)

#-------------------------------------------
# https://uoi.eolymp.space/problems/57
# Круті числа
#
# Число називається крутим, якщо у ньому парна кількість цифр, а також, якщо розділити число по середині на дві частини
# однакової довжини, то новоутворені числа будуть однаковими.
# Наприклад, числа 9595, 11, 880880 — круті, а числа 100 (непарна кількість) та 992993 (992!=993) не є такими.
#
# Знайдіть кількість крутих чисел від 1 до n.
#
# Вхідні дані
# Перший рядок містить одне ціле число n (1≤n<10**12).
# Вихідні дані
# Виведіть кількість чисел.
#
# Приклад 1
# Вхідні дані
# 99
# Вихідні дані
# 9
#
# Приклад 2
# Вхідні дані
# 48
# Вихідні дані
# 4

#Рішення з перебору значень -не ідеальне через завелику к-сть перебору значень
n = int(input())
counter = 0

for i in range(1, n+1):
    txt = str(i)
    if len(txt)%2 == 1:
        continue
    m = int(len(txt)/2)
    if txt[0:m] ==  txt[m:]:
        counter += 1
print(counter)

#Рішення з підбору Крутих чисел
n = int(input())
counter = 0
i=1
while True:
    cool_number = int(str(i)+str(i))
    if cool_number > n:
        break
    counter += 1
    i+=1
print(counter)


#---------------------------------------------
# https://uoi.eolymp.space/problems/66
# Прямі
#
# Дано n точок на декартовій системі координат. Тобто кожна точка має координати (x,y).
#
# Знайдіть кількість трійок точок, які знаходяться на одній горизонтальній або вертикальній прямій. Тобто, потрібно
# порахувати кількість таких трійок (a,b,c), що 1≤a<b<c≤n та pa , pb, pc — на одній прямій, де pi — i-та точка.
#
# Для 50% тестів точок рівно три.
#
# Вхідні дані
# Перший рядок містить одне ціле число n (3≤n≤100).
# Кожен з наступних n рядків містить по два цілі числа xi та yi (1≤xi,yi≤1000) — координати i-ої точки.
# Гарантується, що всі точки різні.
#
# Вихідні дані
# Виведіть кількість трійок точок, що знаходяться на одній прямій.
#
# Приклад 1
# Вхідні дані
# 6
# 1 1
# 1 2
# 1 3
# 2 2
# 2 3
# 3 3
# Вихідні дані
# 2
#
# Приклад 2
# Вхідні дані
# 3
# 5 6
# 5 3
# 5 10
# Вихідні дані
# 1


# Примітка для вчителя - якщо на прямій 4 точки, то до лічильника треба додати усі комбінації трійок з тих 4х точок.
# Тобто, для точок 1,2,3,4 такі комбінації будуть (1,2,3) (1,3,4) (2,3,4) (1,2,4)

#Це рішення рахує кількість прямих, а не комбінацій трійок. Для того, щоб порахувати комбінації трійок, треба  в
# останніх 2х циклах for замість counter += 1 використати формулу комбінаторики
# counter += k * (k - 1) * (k - 2) // 6counter += k * (k - 1) * (k - 2) // 6

n = int(input())
mas = []
counter = 0
for _ in range(n):
    x, y = map(int, input().split())
    mas.append([x, y])

dx = {} # Словник для всіх x
dy = {} # Словник для всіх y

for el in mas: #Рахуємо, скільки разів з'являється кожен х та у в наших точках
    x = el[0]
    y = el[1]
    if x in dx.keys():
        dx[x] += 1
    else:
        dx[x] = 1

    if y in dy.keys():
        dy[y] += 1
    else:
        dy[y] = 1

for key in dx.keys():
    if dx[key] >= 3:
        counter += 1
for key in dy.keys():
    if dy[key] >= 3:
        counter += 1

print(counter)




#----------------------------------------------
# https://uoi.eolymp.space/problems/132
# Козак Вус і важлива знахідка
#
# Зовсім нещодавно мешканці Потоколяндії знайшли стародавню табличку розміром 2×2, в якій розташовано чотири
# числа A, B, C і D так:
# https://drive.google.com/file/d/1m29M2nlfc2l7HI2PMzu1-nZSkmumxY6l/view?usp=sharing
# Вони відразу зрозуміли, що це дуже важлива історична знахідка. Спершу вони віднесли її Козаку Вусу для того, щоб він
# визначив важливість цієї таблички. На думку Козака Вуса, важливість таблички дорівнює A⋅(B+C−D).
# На жаль, правильне положення таблички невідоме. Тому може статись таке, що однозначно визначити важливість таблички
# неможливо, оскільки це значення залежить від того, скільки разів її обернути.
# Припустимо, що один оберт — це оберт за годинниковою стрілкою на 90°.
# Наприклад, якщо A=41, B=99, C=100, D=13, то важливість рівна 41⋅(99+100−13)=7626. А якщо її один раз обернути,
# то 100⋅(41+13−99)=−4500.
# https://drive.google.com/file/d/1iLs-crOp86elXmNPxg4hlP9HZ6xzltCC/view?usp=sharing
# Козак Вус хоче з'ясувати, яку максимальну можливу важливість може мати ця знахідка. Але Вас він просить дізнатись, яку '
# мінімальну кількість обертів потрібно зробити для того, щоб важливість таблички була максимальною.Козак Вус хоче з')ясувати, яку максимальну можливу важливість може мати ця знахідка. Але Вас він просить дізнатись, яку мінімальну кількість обертів потрібно зробити для того, щоб важливість таблички була максимальною.
#
# Вхідні дані
# Перший рядок містить чотири цілих числа A, B, C i D (−10**8 ≤A,B,C,D≤10**8) — числа на табличці.
#
# Вихідні дані
# Виведіть мінімальну кількість обертів, які потрібно зробити Козаку Вусу, щоб важливість таблички була максимальною.
#
# Приклад 1
# Вхідні дані
# 5 3 4 6
# Вихідні дані
# 1
#
# Приклад 2
# Вхідні дані
# 2 9 -4 13
# Вихідні дані
# 3
#
# Приклад 3
# Вхідні дані
# 2 6 3 0
# Вихідні дані
# 0

n1,n2,n3,n4 = map(int, input().split())
variants = [[n1,n2,n3,n4],
            [n3,n1,n4,n2],
            [n4,n3,n2,n1],
            [n2,n4,n1,n3]]
mas = []
for var in variants:
    A = var[0]
    B = var[1]
    C = var[2]
    D = var[3]
    value = A*(B+C-D)
    mas.append( value )

max_value = max(mas)
print(mas.index(max_value))


#---------------------------------------
# https://uoi.eolymp.space/problems/143
# Ліфтом чи пішки
#
# Степан живе на N-му поверсі. Коли Степан заходить в під'їзд, він дивиться, на якому поверсі в цей момент знаходиться
# ліфт і вирішує, викликати ліфт або піти по сходах.
# Сьогодні ліфт знаходиться на K-му поверсі. Степан заходить в під'їзд на 1 поверсі. Він піднімається на один поверх '
# за A секунд. Ліфт переміщається на один поверх за B секунд. Часом входу в ліфт і виходу з ліфта, а також переміщення до
# сходів і назад можна знехтувати.)
# Допоможіть Степану прийняти рішення, виведіть, за який час він потрапить на свій поверх на ліфті і по сходах,
# відповідно.
#
# Вхідні дані
# У єдиному рядку вхідного файлу знаходяться чотири цілих числа N, K, A, B (2≤N≤100, 1≤K≤100, 1≤A,B≤10**3).
#
# Вихідні дані
# Виведіть два цілих числа: час, за який Степан підніметься на свій поверх на ліфті, і час, за який Степан підніметься на
# свій поверх по сходах.
#
# Приклад 1
# Вхідні дані
# 15 8 5 3
# Вихідні дані
# 63 70
# Примітка
# У прикладі ліфту необхідна 7×3=21 секунда, щоб спуститися з 8 поверху і потім 14×3=42 секунди, щоб піднятися на 15
# поверх, де живе Степан. Степану ж необхідно 14×5=70 секунд, щоб піднятися на 15 поверх сходами.

N,K,A,B = map(int, input().split())
lift_way_down = (K-1)*B
lift_way_up = (N-1)*B
by_lift = lift_way_down + lift_way_up
by_foot = (N-1)*A

print(by_lift, by_foot)


#---------------------------------------------
# https://uoi.eolymp.space/problems/206
# Прогулянка
#
# Перед контестом ви вирішили придбати три види цукерок, але от незадача, усі цукерки продаються в окремому магазині.
# Перший вид цукерок продається у першому магазині, другий — у другому і третій у третьому. Ви знаходитесь на координатній
# прямій у точці 0, а магазини з цукерками першого, другого та третього типу мають координати a, b і c відповідно. Ви
# можете пересуватися вліво або вправо на 1 клітинку за одну секунду. Скажіть скільки треба мінімально секунд, щоб
# відвідати усі три магазини.
#
# Вхідні дані
# У першому рядку знаходяться три цілі числа a, b, c (−10**6 ≤a,b,c≤ 10**6) — координати магазинів.
#
# Вихідні дані
# Виведіть одне ціле число — відповідь на задачу.Вхідні дані
# У першому рядку знаходяться три цілі числа a, b, c (−10**6 ≤a,b,c≤ 10**6) — координати магазинів.
#
# Вихідні дані
# Виведіть одне ціле число — відповідь на задачу.
#
# Приклад 1
# Вхідні дані
# 1 2 3
# Вихідні дані
# 3
#
# Приклад 2
# Вхідні дані
# -1 -1 -1
# Вихідні дані
# 1
#
# Приклад 2
# Вхідні дані
# -10 2 4
# Вихідні дані
# 18
#
# Приклад 2
# Вхідні дані
# 7 -5 3
# Вихідні дані
# 17

a, b, c = map(int, input().split())

L = min(0, a, b, c)
R = max(0, a, b, c)

# Довжина всього відрізка + шлях до найближчого з його кінців
ans = (R - L) + min(abs(L), abs(R))

print(ans)


#---------------------------------------------
# https://uoi.eolymp.space/problems/213
# Бібліотека
#
# Через кризу, яка була наслідком появи штучного інтелекту для програмування, ви вирішили влаштуватися працювати в
# бібліотеку. Вас зробили відповідальним за n книжок, які мають свої назви, але для зручності ви вирішили пронумерувати
# їх числами від 1 до n. Кожна книжка зберігається в бібліотеці в єдиному екземплярі. Початково всі книжки є наявними в
# бібліотеці. В перший день до вас завітали m людей, кожен з яких хотів або повернути книжку, або отримати її. Скажіть
# кількість людей, які не змогли отримати бажану книжку.
#
# Вхідні дані
# Перший рядок містить два цілі числа n та m (1≤n≤1000, 1≤m≤5000) — кількість книжок та відвідувачів.
#
# Наступні m рядків містять по два цілі числа t та x (1≤t≤2,1≤x≤n), які описують відповідного відвідувача. Якщо t = 1, то
# відвідувач намагається отримати книжку з номером x, якщо t = 2, то хоче повернути книжку з номером x.
#
# Гарантується, що якщо книжку повертають в магазин, то вона була взята до цього.
#
# Вихідні дані
# Виведіть одне ціле число — відповідь на задачу.
#
# Приклад 1
# Вхідні дані
# 2 6
# 1 2
# 1 1
# 1 1
# 2 1
# 1 2
# 1 1
# Вихідні дані
# 2
#
# Примітка
# У першому прикладі в бібліотеці існують 2 книжки. До першого відвідувача обидві книжки є в наявності в магазині.
# Перший відвідувач приходить та намагається взяти книжку з номером 2, оскільки вона є в бібліотеці, то він її забирає
# і виходить.
# Далі приходить другий і забирає книжку з номером 1, оскільки вона є в бібліотеці.
# Третій відвідувач хоче взяти книжку з номером 1, але він не може цього зробити, бо вона вже взята другим відвідувачем.
# Далі другий відвідувач приходить та повертає книжку з номером 1.
# П'ятий відвідувач хоче взяти книжку з номером 2, але вона вже взята першим відвідувачем, тому нічого не бере та йде '
# додому.
# Шостий відвідувач хоче взяти книжку з номером 1, оскільки вона є в наявності, він її бере та йде додому.
# Всього дві людини не змогли отримати бажану книжку, тому відповідь дорівнює 2.

n, operations = map(int, input().split())
catalog = []
loosers = 0
for i in range(1,n+1):
    catalog.append(i)

for _ in range(operations):
    t, x = map(int, input().split())
    if t == 2:
        catalog.append(x)
    if t == 1:
        if x in catalog:
            catalog.remove(x)
        else:
            loosers += 1
print(loosers)


#----------------------------------------
# https://uoi.eolymp.space/problems/468
# Прямокутник
#
# Дано прямокутник, який складається з n×m клітин (n клітин у висоту та m клітин у ширину). Визначте площу усіх клітин,
# що знаходяться на межі.
# На малюнку зображено прямокутник з висотою n=4 та шириною m=6. Клітини, що знаходяться на межі, розфарбовані в голубий.
# Площа таких клітин — 16
# https://drive.google.com/file/d/1MlRAHa_QkwKakCF_waxkNkkUs7s34NbV/view?usp=sharing
#
# Вхідні дані
# Перший рядок містить одне ціле число n (2≤n≤100) — висота прямокутника.
# Другий рядок містить одне ціле число m (2≤m≤100) — ширина прямокутника.
#
# Вихідні дані
# Виведіть одне ціле число — відповідь на задачу.
#
# Приклад 1
# Вхідні дані
# 4 6
# Вихідні дані
# 16

n = int(input())
m = int(input())
res = 2*(n+m) - 4
print(res)


#----------------------------------------
# https://uoi.eolymp.space/problems/470
# Матричка
#
# Козак Вус готується до міжгалактичної олімпіади з інформатики, кожного дня розв'язуючи по 8 задач, і сьогодні — не
# виключення. Проте, дійшовши до цієї задачі, він вирішив, що йому ця задача не подобається. Саме тому тепер вирішити цю
# задачу повинні ви.
# У вас є матриця, яка складається з n рядків та m стовпчиків. На початку усі клітини незафарбовані. Ви можете зафарбувати
# деяку кількість клітин в цій матриці.
# Матриця буде гарною, якщо на кожній антидіагоналі є хоча б одна зафарбована клітина. Антидіагоналями називають
# діагоналі, що йдуть зліва знизу вправо вгору.
# https://drive.google.com/file/d/1fHyarUR1mcXmb_mhdobs2GWNvvTWnHYq/view?usp=sharing
# На малюнку зеленим зображені усі антидіагоналі для матриці n=3,m=5, а червоним — головні діагоналі, які вас в цій
# задачі не цікавлять
# Допоможіть Козаку Вусу і скажіть, чи можливо зафарбувати рівно K клітинок в матриці таким чином, щоб вона стала гарною.
#
# Вхідні дані
# Єдиний рядок вхідних даних містить три цілі числа n,m,k (1≤n,m≤100; 0≤k≤n⋅m) — розміри матриці та кількість клітинок,
# яку потрібно зафарбувати відповідно.
#
# Вихідні дані
# Виведіть "YES", якщо можна зафарбувати рівно K клітинок, щоб матриця стала гарною, або "NO" у іншому випадку.
#
# Примітка
# У першому прикладі можна зафарбувати клітини наступним чином:
# https://drive.google.com/file/d/1CHN6smDbeLa-8vfnzsaSd-XlVnIAmRcd/view?usp=sharing
# Зеленим позначено антидіагоналі, а сірим — зафарбовані клітини
# У другому прикладі можна зафарбувати клітини наступним чином:
# https://drive.google.com/file/d/1gNw_WSJMiVFrXweK77sQZsQkSUd--eZE/view?usp=sharing
# Зеленим позначено антидіагоналі, а сірим — зафарбовані клітини
# У третьому та четвертому прикладах не можна зафарбувати клітини, аби матриця стала гарною.
#
# Приклад 1
# Вхідні дані
# 3 5 7
# Вихідні дані
# YES
#
# Приклад 2
# Вхідні дані
# 4 2 6
# Вихідні дані
# YES
#
# Приклад 3
# Вхідні дані
# 1 1 0
# Вихідні дані
# No
#
# Приклад 4
# Вхідні дані
# 3 3 3
# Вихідні дані
# No


n, m, k = map(int, input().split())
if n + m - 1 <= k <= n * m:
    print("YES")
else:
    print("NO")


#----------------------------------------
# https://uoi.eolymp.space/problems/472
# Конструктор
m = list(map(int, input().split()))
print("NO") if m.count(0)>2 else print("YES")



#----------------------------------------

# https://uoi.eolymp.space/problems/474
# Дивний сон
#
# Невідомим чином Козак Вус опинився на нескінченній числовій прямій у координаті x. Протягом n секунд, кожної секунди
# i (1≤i≤n) відбувалося наступне: на початку i-ої секунди він бачив деяке число yi наприкінці i-ої секунди він опинявся у
# найближчій координаті, яка є кратною yi (тобто, координаті, що націло ділиться на y
# i). Якщо таких координат декілька, він опинявся у найменшій з них.
# Зверніть увагу, що він ніколи не може опинитися у від'ємній координаті.
# Прокинувшись, Козак Вус зрозумів, що це був сон: він чітко пам'ятає всі yi
# та тривалість сну n, але не може згадати, у якій координаті опинявся наприкінці кожної секунди. Заспокойте Козака Вуса
# й допоможіть відновити цей дивний сон!
#
# Вхідні дані
# Перший рядок містить два цілі числа n та x (1≤n≤2⋅10**5; 0≤x≤10**4) — тривалість дивного сну і початкова координата
# Козака Вуса відповідно.
# Другий рядок містить n цілих чисел y1,y2,…,yn (1≤yi≤10**4), де yi — число, яке Козак Вус бачив на початку i-ої
# секунди сну.
#
# Вихідні дані
# Виведіть n цілих чисел c1,c2,…,cn, де ci — координата, у якій опинявся Козак Вус наприкінці i-ої секунди сну.
#
# Примітка
# У першому прикладі Козак Вус починає з координати 2.
# На початку першої секунди Козак Вус бачить число y1=2. Найближчою координатою до 2 кратною 2 є 2. Тому наприкінці першої
# секунди Козак Вус залишиться у координаті 2.
# На початку другої секунди Козак Вус бачить число y2=4. Найближчими координатами до 2 кратними 4 є 0 та 4. Оскільки 0<4,
# то наприкінці другої секунди Козак Вус опиниться у координаті 0.
# На початку третьої секунди Козак Вус бачить число y3=1. Найближчою координатою до 0 кратною 1 є 0. Тому наприкінці
# третьої секунди Козак Вус залишиться у координаті 0.
#
# У другому прикладі Козак Вус починає з координати 5.
# На початку першої секунди Козак Вус бачить число y1=2. Найближчими координатами до 5 кратними 2 є 4 та 6.
# Оскільки 4<6, то наприкінці першої секунди Козак Вус опиниться у координаті 4. На початку другої секунди Козак Вус
# бачить число y2=3. Найближчою координатою до 4 кратною 3 є 3. Тому наприкінці другої секунди Козак Вус залишиться у
# координаті 3.
# На початку третьої секунди Козак Вус бачить число y3=2. Найближчими координатами до 3 кратними 2 є 2 та 4.
# Оскільки 2<4, то наприкінці третьої секунди Козак Вус опиниться у координаті 2.
#
# У третьому прикладі Козак Вус починає з координати 10**4.
# На початку першої секунди Козак Вус бачить число y1=5001. Найближчою координатою до 10000 кратною 5001 є 10002.
# Тому наприкінці першої секунди Козак Вус опиниться у координаті 10002.
#
#
# Приклад 1
# Вхідні дані
# 3 2
# 2 4 1
# Вихідні дані
# 2 0 0
#
# Приклад 2
# Вхідні дані
# 3 5
# 2 3 2
# Вихідні дані
# 4 3 2
#
# Приклад 3
# Вхідні дані
# 1 10000
# 5001
# Вихідні дані
# 10002

n,x = map(int, input().split())
mas = list(map(int, input().split()))
result = []

for i in mas:
    left = (x // i) * i
    right = left + i

    dL = x - left
    dR = right - x

    if dL <= dR:
        x = left
    else:
        x = right
    result.append(str(x))

print(" ".join(result))


#----------------------------------------
# https://uoi.eolymp.space/problems/475
# Мобільна гра
#
# Нещодавно Козак Вус придбав собі новий телефон, і аби насолодитися новітніми технологіями, він вирішив пограти у
# популярну гру Stawl Brars. Сенс гри полягає у наступному:
# У рядок розташовано n сейфів, пронумерованих від 1 до n зліва направо. Кожен сейф містить рівно одну з двох кількостей
# монет: 1 або 2 золоті монети. Козаку Вусу потрібно здобути якомога більше золотих монет. Для цього він може вибрати
# підвідрізок [l,r] (1≤l≤r≤n) на цьому рядку і застосувати на ньому одну з наступних атак:
# Звичайна атака — вибиває рівно 1 монету з кожного сейфу на [l,r]. Ця операція завжди дозволена. Кількість здобутих монет
# дорівнює r−l+1.
#
# Суператака — вибиває рівно 2 монети з кожного сейфу на [l,r]. Операція дозволена лише тоді, коли усі сейфи на
# підвідрізку [l,r] містять по 2 монети. Кількість здобутих монет дорівнює 2⋅(r−l+1).
# Потрібно вибрати операцію (або не виконувати жодної) та підвідрізок так, щоб загальна кількість здобутих монет була
# максимальною.
#
# Вхідні дані
# Перший рядок містить одне ціле число n (1≤n≤2⋅10**5) — довжина рядка.
# Другий рядок містить n цілих чисел c1,c2,…,cN (1≤ci≤2), де ci— кількість золотих монет в i-му сейфі.
#
# Вихідні дані
# Виведіть одне ціле число — максимальну кількість монет, яку може здобути Козак Вус.
#
#
# Приклад 1
# Вхідні дані
# 5
# 2 1 2 2 2
# Вихідні дані
# 6
#
# Приклад 2
# Вхідні дані
# 4
# 1 1 1 1
# Вихідні дані
# 4
#
# Приклад 3
# Вхідні дані
# 6
# 2 2 1 1 2 2
# Вихідні дані
# 6

n = int(input())
mas = map(int, input().split())

max_2 = 0
counter = 0
for i in mas:
    if i == 2:
        counter += 1
        if counter > max_2:
            max_2 = counter
    else:
        counter =0

if n > max_2*2:
    print(n)
else:
    print(max_2*2)



#---------------------------------------
# https://uoi.eolymp.space/problems/6
# До чого ЗНО доводить...
#
# Поки Петрик ходив розважався у кіно — інші студенти активно вчились. Так, після хвилі ностальгії по старим часам, Даня
# з Діаною вирішили позмагатись у вирішенні двох останніх та улюблених ними задач із ЗНО з математики: стереометрії та
# параметра. Для обох студентів випадковим чином були згенеровані набори завдань. Таким чином Даня отримав n наборів
# задач по ai задач в кожному, а Діана отримала m наборів задач по bi в кожному. За умовами змагання, учасники мають
# послідовно розв'язувати свої набори завдань починаючи від першого.
#
# Усе було б чудово, якби люди не мали фізичних обмежень, тож, на жаль, кожен з учасників має фіксовану максимальну
# ефективність e, яка дорівнює кількості задач, яку той може зробити за одну годину. Крім того, втомлюючись люди
# починають думати повільніше, тому щогодини ефективність учасника зменшується рівно на 1, поки не дійде до нуля.
#
# Щоб компенсувати цю несправедливість життя, кожен раз як учасник повністю вирішує набір задач, то він одразу наливає
# собі святковий келих "хербатки" (від пол. herbata, чай) та завдяки ньому відновлює свою ефективність до максимуму, а
# відлік години починається спочатку. Зверніть увагу, що якщо в цей момент мало відбутись зниження ефективності, то воно
# не відбувається. Переможцем змагання стає учасник, що розв'язав найбільшу кількість задач.
#
# Петрик послухав це все і вирішив зробити ставку на переможця. Допоможіть, будь ласка, Петрику визначитись, хто стане
# переможцем змагання, та, який буде фінальний рахунок вирішених задач, якщо обидва учасники хочуть перемогти.
#
# Вхідні дані
# Перший рядок містить два цілі числа n,m (1≤n,m≤2⋅10**5).
# Другий рядок містить n цілих чисел ai(1≤ai≤10**9).
# Третій рядок містить m цілих чисел bi (1≤bi≤10**9).
# Четвертий рядок містить одне ціле число e (1≤e≤10**9)
#
# Вихідні дані
# У першому рядку виведіть ім'я переможця («Danya» або «Diana») або «Draw» у випадку нічиї.
# У другому рядку через двокрапку виведіть фінальний рахунок: кількість задач розв'язаних переможцем та кількість задач
# розв'язаних його опонентом.
#
#
# Приклад 1
# Вхідні дані
# 2 3
# 2 1
# 3 4 5
# 2
# Вихідні дані
# Diana
# 6:3
#
# Приклад 2
# Вхідні дані
# 3 2
# 4 8 3
# 4 2
# 5
# Вихідні дані
# Danya
# 15:6
#
# Приклад 3
# Вхідні дані
# 2 2
# 3 2
# 3 2
# 2
# Вихідні дані
# Draw
# 5:5
#
# Примітка
# У першому прикладі ефективність кожного учасника дорівнює 2. Тоді за першу годину Даня розв'яже перший набір з двох
# задач та вип'є чай для відновлення своєї ефективності до максимуму. Після цього за другу годину він розв'яже другий та
# останній для себе набір з однієї задачі, що дасть в сумі 3 розв'язані задачі.
# У свою чергу Діна за першу годину розв'яже дві задачі, а за другу годину ще одну задачу, що завершить вирішення першого
# набору задач. Після цього поновивши енергію чаєм за третю годину буде вирішено 2 задачі з другого набору, за четверту
# годину 1 задача з другого набору та у зв'язку з спадом ефективності до нуля на цьому рішення задач цієї ночі буде
# завершене. Таким чином в сумі розв'язано 6 задач.

n, m = map(int, input().split())
a = list(map(int, input().split()))
b = list(map(int, input().split()))
e = int(input())

efectyvn = (e+1)/2 * e
danya = 0
diana = 0
for i in a:
    if i <= efectyvn:
        danya += i
    else:
        danya += efectyvn
        break

for i in b:
    if i <= efectyvn:
        diana += i
    else:
        diana += efectyvn
        break


if danya == diana:
    print("DRAW")
    print(f"{int(danya)}:{int(diana)}")
elif danya > diana:
    print("Danya")
    print(f"{int(danya)}:{int(diana)}")
else:
    print("Diana")
    print(f"{int(diana)}:{int(danya)}")



#---------------------------------------
# https://uoi.eolymp.space/problems/15
# Степан і сірники
#
# Cтепан дуже полюбляє гратись із сірниками. Але він не балується ними, не розпалює вогонь, а вирішує різні головоломки.
# Наприклад, він уміє прирівнювати число дев'ять до числа одинадцять, переклавши лише один сірник.
# Нещодавно батьки Степана подарували йому декілька наборів, кожен з яких складається з дванадцяти сірників. Хлопчик
# почав збирати з них різні геометричні фігури. Він вже зібрав багато різних фігур, але тепер йому стало цікаво: з яких
# наборів можливо склеїти каркас паралелепіпеда за допомогою дванадцяти сірників з набору та клею? Ламати сірники не
# можна і жоден із сірників не повинен виступати за каркас.
# Ваше завдання полягає в тому, щоб за відомими довжинами сірників для кожного набору перевірити, чи можна з них склеїти
# каркас паралелепіпеда.
#
# Вхідні дані
# Перший рядок вхідного файлу містить одне ціле число N (1≤N≤100), яке представляє кількість наборів.
# Далі йдуть N рядків, кожен з яких містить у собі опис набору сірників — дванадцять цілих позитивних чисел, що не
# перевищують 10**9.
#
# Вихідні дані
# Вихідний файл має містити N рядків. Для кожного набору сірників виведіть "yes", якщо з нього можливо склеїти каркас
# паралелепіпеда, і "no" в іншому випадку.
#
# Коментар: паралелепіпед створиться, якщо у сірників буде 4 однакових сірника для довжини, 4 однакових сірника для ширини
# і 4 однакових сірника для висоти.
#
# Приклад 1
# Вхідні дані
# 2
# 1 1 1 1 2 2 2 2 3 3 3 3
# 1 1 1 1 2 2 2 2 3 3 3 4
# Вихідні дані
# Diana
# yes
# no

n = int(input())
mas = []
for i in range(n):
    mas.append(list(map(int, input().split())))

for m in mas: #розглядаємо окремий набір m
    res = "yes"
    m_set = set(m) #перетворюємо набір на set, щоб прибрати дублікати.
    if len(m_set) != 3: #Нам потрібно, щоб в сеті залишилось з значення - 3 набора довжин
        res = "no"
    for el in m_set: # Перебираємо елементи сету (довжини)
        if m.count(el) != 4: #В наборі m повинно всіх довжин бути по 4
            res = "no"
    print(res)




# https://uoi.eolymp.space/problems/16
# Задача від Степана
#
# Перебираючи свої дитячі іграшки, Степан знайшов набір із N різних прямокутників і згадав задачу, яку йому колись задав
# старенький вчитель математики.
# Назвемо прямокутник маленьким, якщо знайдеться інший прямокутник з даного набору, яким можна повністю накрити цей
# прямокутник. При цьому прямокутники можна повертати, але відповідні сторони мають бути паралельними.
# Наприклад, прямокутник зі сторонами 1 і 10 можна повністю накрити прямокутником 10 і 3, але неможна накрити
# прямокутником зі сторонами 9 і 9. Прямокутники зі сторонами 10 і 3, а також зі сторонами 9 і 9 накрити неможна,
# відповідно в наборі із цих трьох прямокутників тільки один маленький.
#
# Напишіть програму, яка вирішить згадану Степаном задачу – визначить кількість маленьких прямокутників у даному наборі.
#
# Вхідні дані
# Перший рядок вхідного файлу містить одне ціле число N (2≤N≤200000).
# У кожному з наступних N рядків міститься два цілих додатних числа – розміри одного прямокутника. Усі розміри не
# перевищують 1000000. Серед даних прямокутників немає однакових.
#
# Вихідні дані
# Вихідний файл має містити одне ціле число – кількість маленьких прямокутників у даному наборі.
#
# Приклад 1
# Вхідні дані
# 3
# 1 10
# 9 9
# 10 3
# Вихідні дані
# 1
#
# Приклад 2
# Вхідні дані
# 4
# 1 7
# 2 6
# 3 5
# 4 4
# Вихідні дані
# 0

n = int(input())
mas = []
mas_x = []
mas_y = []
res = 0

for i in range(n):
    m = list(map(int, input().split()))
    m.sort() #сортуємо, щоб всі прямокутники мали меньше сторону першою, тобто були повернуті в одну сторону
    mas_x.append(m[0])
    mas_y.append(m[1])

for i in range(n):
    print("res = ", res)
    # i - номер прямокутника, який перевіряємо
    for j in range(n): # j - номери всіх прямокутників по черзі
        # first_check = mas_x[i] <= mas_x[j] and mas_y[i] <= mas_y[j] #порівнюємо x поточного прямокутника  з x базового, те ж саме з у і у
        # second_check = mas_x[i] <= mas_y[j] and mas_y[i] <= mas_x[j] #перевертаємо прфмокутник, тобто порівнюємо х з у, те ж саме у з х
        # if first_check or second_check:
        #     res += 1

        if i!=j: # уникаємо самого себе
            if mas_x[i] <= mas_x[j] and mas_y[i] <= mas_y[j]:  # порівнюємо x поточного прямокутника  з x базового, те ж саме з у і у
                res += 1
                break
print(res)





# https://uoi.eolymp.space/problems/18
# Ремонт
#
# Степан придбав нову квартиру і до приїзду батьків вирішив поклеїти шпалери. На перший погляд все просто, але, коли він
# приступив до роботи, виявилась невелика проблема – необхідно вирівнювати рисунок на сусідніх полосах шпалер. Як визнаний
# програміст, Степан сформулював задачу таким чином.
# Кожну полосу шпалер можна описати її частиною – прямокутником довжиною N і шириною M (щоб отримати повну полосу, цей
# прямокутник можна багато разів домалювати до самого себе справа і зліва). Для простоти подумки поділимо цей прямокутник
# на рівні клітинки так, щоб утворилось N рядків і M стовпців. Щоб було ще простіше, рисунок на шпалерах позначимо
# символами "." і "*" (крапка і зірочка), по одному символу в кожній клітинці.
#
# Вам дано опис двох полос шпалер. Допоможіть Степану, напишіть програму, яка визначатиме, на яку мінімальну кількість
# клітинок потрібно змістити другу полосу вправо, щоб її малюнок співпав з малюнком на першій полосі. Степан придбав такі
# шпалери, що гарантовано завжди можна це зробити.
#
# Вхідні дані
# Перший рядок вхідного файлу містить два цілих числа N і M (1≤N≤20, 1≤M≤100000). Наступні N рядків містять по M символів
# кожна – опис першої полоси шпалер. Наступні N рядків містять по M символів кожна – опис другої полоси шпалер. Кожен
# рядок опису шпалер містить тільки символи "." і "*".
#
# Вихідні дані
# Вихідний файл має містити одне число – на яку мінімальну кількість клітинок потрібно змістити другу полосу вправо, щоб
# її малюнок співпав з малюнком на першій полосі.

#
# Приклад 1
# Вхідні дані
# 2 5
# .*.*.
# *.*.*
# *.*..
# .*.**2 5
# .*.*.
# *.*.*
# *.*..
# .*.**
# Вихідні дані
# 1
#
# Приклад 2
# Вхідні дані
# 1 5
# ***..
# *..**1 5
# ***..
# *..**
# Вихідні дані
# 2

n,m = map(int,input().split())
base = []
res = []
for i in range(n):
    base.append(input())
for i in range(n):
    res.append(input())

# Рішення за допомогою перебору
# base = base[0] #беремо першу строчку. Якщо малюнки однакові, то нам достатньо розрахувати зсув для 1 строчки.
 # Це буде справедливо і до всіх інших. Але в задачі напевно очікується, що ми перевіримо всі строчки )))
# res = res[0]#беремо першу строчку
# i=0
# while base != res:
#     res= res[-1]+res[:-1] #змінюємо першу строчку, поки вона не стане однаковою
#     i+=1
# print(i)

# рішення за домомогою .find()
res = res*2
print(m-res.find(base))


#-----------------------------------

# Дано ціле 32-бітне ціле число зі знаком x, поверніть x з перевернутими цифрами. Якщо переворот x викликає вихід
# значення за межі діапазону 32-бітних цілих чисел [-2^31, 2^31 - 1], тоді поверніть 0.
# Припустимо, що середовище не дозволяє вам зберігати 64-бітні цілі числа (підписані або беззнакові).
#
# Example 1:
# Input: x = 123
# Output: 321
#
# Example 2:
# Input: x = -123
# Output: -321
#
# Example 3:
# Input: x = 120
# Output: 21
#
#
#
#
# --- РІШЕННЯ У ВИГЛЯДІ ТЕКСТОВОГО ПЕРЕБОРУ

# x = -321
#
# if x<0:
#     znak = -1
# else:
#     znak = 1
#
#
#
# y = str(abs(x))
# res = ""
#
# print(y)
# print(type(y))
# print(len(y))
# l = len(y)
#
#
# for i in range(l):
#     print(y[l-1-i])
#     res = res + y[len(y)-1-i]
#
# res = int(res)
#
# print(res * znak)



# --- РІШЕННЯ У ВИГЛЯДІ МАНІПУЛЯЦІЇ З ЧИСЛАМИ

x = -321
res = 0

znak = x / abs(x) #зберігаємо знак
x = abs(x) #зберігаємо число без знаку
lenght = len(str(abs(x))) #визначаємо довжину числа

for i in range(lenght): #перебираємо розряди по довжині числа
    z = x / (10**i) #ділимо число на 1, 10, 100, 1000 і т.д, кожен раз залишається все більший хвостик
    print("z --> ", z)
    z = round(z, 0) #округлюємо число до одиниць, таким чином остання цифра буде поточним числом на додавання до результату
    print("z --> ", z)
    res += (z % 10) * (10**(lenght-1-i)) #відокремлюємо останнє число і підносимо його в правильну степінь
    print("res --> ", res)

res = res * znak #додаємо знак
print(res)



#-----------------------------------------------

# // Дано рядок s, що складається зі слів та пробілів, поверніть довжину останнього слова в рядку.
# // Слово — це максимальний підрядок, що складається тільки з непробільних символів.
# // Приклад 1:
# // Вхідні дані: s = "Hello World"
# // Вихідні дані: 5
# // Пояснення: Останнє слово — "World", його довжина 5.
# //
# // Приклад 2:
# // Вхідні дані: s = " fly me to the moon "
# // Вихідні дані: 4
# // Пояснення: Останнє слово — "moon", його довжина 4.
# //
# // Приклад 3:
# // Вхідні дані: s = "luffy is still joyboy"
# // Вихідні дані: 6
# // Пояснення: Останнє слово — "joyboy", його довжина 6.

string = "luffy is still joyboy      "

#РІШЕННЯ 1
lst = string.split()
last_word = lst[len(lst)-1]
print(len(last_word))

#РІШЕННЯ 2
string = "luffy is still joyboy      "

counter = 0
for i in range(len(string)-1, -1, -1):
    if string[i] == " " and counter > 0:
        break
    elif string[i] != " ":
        counter += 1
print(counter)




