# https://uoi.eolymp.space/en/problems/23

# Коригування масивів
#
# Голова журі олімпіади згенерував декілька числових масивів, які будуть вхідними даними для цікавої задачі.
# Але ці масиви йому не подобаються, тому що вони не відсортовані!
# Сортувати ці масиви голова журі не хоче.
# Єдине що він збирається робити − трішки відкоригувати масиви, змінюючи знаки у деяких.
# Іншими словами, можна робити дуже просту операцію: деякі елементи a[i] замінити на −a[i].
#
# Напишіть програму, яка з'ясує, чи зможе голова журі за допомогою описаної операції зробити масив відсортованим за неспаданням.
#
# Input
# У першому рядку вхідних даних дано ціле число N − кількість елементів у масиві (1≤N≤100000).
# У наступному рядку дано n цілих чисел a[i] − масив, який голова журі олімпіади хоче зробити відсортованим за неспаданням (|a| <= 100000).
#
# Output
# Якщо не можна замінити деякі елементи a[i] на −a[i], так щоб масив став відсортованим за неспаданням, виведіть «NO».
# Інакше, у першому рядку виведіть «YES». У другому рядку виведіть N чисел b[i] − масив, для всіх елементів якого виконується:
# b[i] ≤ b[i+1];
# b[i] = a[i] або b[i] = -a[i]

# Examples
#
# Input #1
# 5
# 1 -1 -2 3 6
# Answer #1
# YES
# -1 -1 2 3 6
#
# Input #2
# 3
# 1 1 0
# Answer #2
# YES
# -1 -1 0


N = 5
# a = [-1, -2, -3]
a = [10, -5, -6,  6, -6] # моя програма не проходить на сайті. Подумати чому, спробувати код Олега, розібратись

def foo(a):
    prev = -100000000

    for i in range(N):
        positive = abs(a[i])
        negative = -abs(a[i])

        if prev <= negative:
            print("--> 1")
            a[i] = negative
            prev = a[i]
            continue
        elif prev <= positive:
            print("--> 2")
            a[i] = positive
            prev = a[i]
            continue
        else:
            return False
    return True

if foo(a):
    print("YES")
    print(a)
else:
    print("NO")

#
# Рішення Олега
# def foo(a):
#     prev = -100000000
#
#     for i in range(N):
#         if a[i] >= a[i+1] :
#             if -a[i] <= a[i+1] and -a[i] >= prev:
#                 a[i] = -a[i]
#             elif a[i] <= -a[i+1] :
#                 a[i + 1] = -a[i+1]
#             elif a[i] != a[i+1]:
#                 sorted = False
#                 break
#             prev = a[i]
#
#     if sorted:
#         print("YES")
#         print a
#     else:
#         print("NO")

