# В Анатолія є a яблук та b груш, а в Бориса c яблук та d груш.
# Вони хочуть роздати яблука та груші n дітям. Кожна дитина хоче x яблук та y груш.
# Визначте, чи зможе Анатолій та Борис роздати яблука та груші дітям так, щоб кожен отримав те, що він хоче.

# Input
# Перший рядок містить сім цілих чисел a, b, c, d, n, x, y (1≤a,b,c,d,n,x,y≤100).
# Output
# Виведіть «Yes», якщо хлопці зможуть це зробити, або «No» — інакше.
# Ви можете виводити букви у будь-якому регістрі.
# Examples

# Input
# 3 4 5 4 3 1 2
# Answer
# Yes

a, b, c, d, n, x, y = input().split()
a= int(a)
b= int(b)
c= int(c)
d= int(d)
n= int(n)
x= int(x)
y= int(y)

apples = a + c
pears = b + d

if apples/n >= x and pears / n >= y:
    print("YES")
else:
    print("NO")
