// Ігорчик та яблучка


// В Ігорчика є сад з трьома видами яблук: зелених, жовтих та червоних. Цього року він зібрав n зелених, m жовтих та k червоних яблук.

// Оскільки Ігорчик дружить з усіма сусідами, то він вирішив роздати яблука, які зібрав. Він знає, що кожен сусід буде задоволений, якщо Ігорчик подарує йому яблука принаймні двох різних видів.

// Допоможіть Ігорчику знайти максимальну кількість сусідів, які можуть бути задоволені.

// Input

// Перший рядок містить три цілі числа n, m та k (0≤n,m,k≤100) — кількість зелених, жовтих та червоних яблук відповідно.

// Output

// Виведіть одне ціле число — відповідь на задачу.

// Examples

// Input                                   Answer 
// 6 3 4                                   6


process.stdin.on('data', function (data) {
    let n = String(data).trim().split(" ").map(el => Number(el));

    n.sort((a, b) => b - a);

    while (n[0] > 0) {
        if (n[1] > 0) {
            n[0]--;
            n[1]--;
            counter++;
        }
        if (n[2] > 0 && n[0] > 0) {
            n[0]--;
            n[2]--;
            counter++;
        }
        if (n[1] == 0 && n[2] == 0) {
            n[0] = 0
        }
    }
    if (n[1] > 0 && n[2] > 0) {
        while (n[1] > 0) {
            n[1]--;
            n[2]--;
            counter++;
        }
    }
    console.log(counter)
});
