Журі олімпіади з інформатики прийняло рішення, що всі учасники мають отримати сертифікат:
- ті, хто набере не менш ніж 90% від максимальної кількості балів, отримають сертифікат OUTSTANDING − видатний результат;
- ті, хто набере менше ніж 90%, але не менш ніж 74% від максимальної кількості балів, отримають сертифікат EXCELLENT − відмінний результат;
- ті, хто набере менше ніж 74%, але не менш ніж 60% від максимальної кількості балів, отримають сертифікат VERY GOOD − дуже  добрий результат;
- усі інші отримають сертифікат PARTICIPANT.
Нам потрібна програма, для автоматизації вирішення, який сертифікат має отримати учасник олімпіади. Напишіть таку програму!

