# Ім’я вхідного файлу:  inattention.in
# Ім’я вихідного файлу:  inattention.out
#
# Степан вдало пройшов співбесіду і ось уже як чотири місяці працює на одній із самих престижних ІТ компаній.
# Прийшов час здавати проект менеджеру і Степан, як істинний студент, все виконує у останню ніч перед здачею.
# Набирає текст Степан звичайно дуже швидко, але неуважно.
# От і цього разу останню частину тексту він набрав не звернувши уваги, що випадково натиснув клавішу caps lock.
# Таким чином великі букви були набрані маленькими, а маленькі великими. Інші символи він набрав вірно.
# Степан настільки стомився, що немає сил виправити помилки, і він вирішив кілька годин поспати.
# Допоможіть Степану, доки він спить, напишіть програму, яка виправляє неуважно набраний текст.
# Формат вхідних даних: перший рядок вхідного файлу містить неуважно набраний Степаном текст, який містить не більше 500 символів.
# Формат вихідних даних: вихідний файл має містити виправлений текст.
#
# Приклад вхідних і вихідних даних:
# inattention.in sCHOOL
# inattention.out  School

text = input()

res = ""
for s in text:
    if s.islower():
        res += s.upper()
    else:
        res += s.lower()

print(res)
